Revit 2027 API
ClipPlane Constructor
 Constructs a copy of the clip plane.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ClipPlane(
	ClipPlane other
)
Public Sub New (
	other As ClipPlane
)
public:
ClipPlane(
	ClipPlane^ other
)
new :
        other : ClipPlane -> ClipPlane
Parameters
other ClipPlane
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace